# IS 362 - Week 7 Assignment
Sunah Lee

## Movie Ratings
Choose six recent popular movies. Ask at least five people that you know (friends, family, classmates,
imaginary friends) to rate each of these movies that they have seen on a scale of 1 to 5.

In [1]:
#Load the ratings by user information that you collected into a pandas dataframe
import pandas as pd
import numpy as np
df = pd.read_csv('Movies.csv', index_col=0)
df

,Parasite,Joker,Toy Story 4,Frozen II,Little Women,The Marriage Story
Hazel,5.0,NaN,3.0,3.0,NaN,NaN
Mark,4.0,4.0,NaN,4.0,NaN,NaN
Vivian,5.0,NaN,5.0,NaN,4.0,3.0
John,5.0,5.0,4.0,4.0,3.0,3.0
Rachel,NaN,3.0,4.0,4.0,NaN,NaN
Christine,5.0,4.0,NaN,NaN,3.0,NaN

## Averages

In [2]:
#Show the average ratings for each user and each movie
average_per_user = df.mean(axis=1)
average_per_user

Hazel        3.666667
Mark         4.000000
Vivian       4.250000
John         4.000000
Rachel       3.666667
Christine    4.000000
dtype: float64

In [3]:
average_per_movie = df.mean()
average_per_movie

Parasite              4.800000
Joker                 4.000000
Toy Story 4           4.000000
Frozen II             3.750000
Little Women          3.333333
The Marriage Story    3.000000
dtype: float64

## Normalized Database

In [4]:
#Create a new pandas dataframe, with normalized ratings for each user. 
#Again, show the average ratings for each user and each movie.
normalized_df = (df - df.min()) / (df.max() - df.min())
normalized_df

,Parasite,Joker,Toy Story 4,Frozen II,Little Women,The Marriage Story
Hazel,1.0,NaN,0.0,0.0,NaN,NaN
Mark,0.0,0.5,NaN,1.0,NaN,NaN
Vivian,1.0,NaN,1.0,NaN,1.0,NaN
John,1.0,1.0,0.5,1.0,0.0,NaN
Rachel,NaN,0.0,0.5,1.0,NaN,NaN
Christine,1.0,0.5,NaN,NaN,0.0,NaN

## Normalized Averages

In [5]:
avg_normalized_user = normalized_df.mean(axis=1)
avg_normalized_user

Hazel        0.333333
Mark         0.500000
Vivian       1.000000
John         0.700000
Rachel       0.500000
Christine    0.500000
dtype: float64

In [6]:
avg_normalized_movie = normalized_df.mean()
avg_normalized_movie

Parasite              0.800000
Joker                 0.500000
Toy Story 4           0.500000
Frozen II             0.750000
Little Women          0.333333
The Marriage Story         NaN
dtype: float64

## Provide a text-based conclusion: 
#### Explain what might be advantages and disadvantages of using normalized ratings instead of the actual ratings

Normalization scals all numeric variables in the range 0 to 1. Normalizing is better in data duplication in a bigger data set where all parameters need to have the same positive scale. However, disadvantages include the loss of outliers. In a small sample of movie ratings above, normalization does not provide much use. Especially for data like the ratings for the movie "The Marriage Story" above, where it consists of two 3.0 ratings and the max-min is zero, the normalized rating provides no information as to what the actual ratings were.

## Extra Credit: Standardized Database

In [7]:
#Create another new pandas dataframe, with standardized ratings for each user.
#Once again, show the average ratings for each user and each movie
standardized_ratings = (df-df.mean()) / df.std()
standardized_ratings

,Parasite,Joker,Toy Story 4,Frozen II,Little Women,The Marriage Story
Hazel,0.447214,NaN,-1.224745,-1.5,NaN,NaN
Mark,-1.788854,0.000000,NaN,0.5,NaN,NaN
Vivian,0.447214,NaN,1.224745,NaN,1.154701,NaN
John,0.447214,1.224745,0.000000,0.5,-0.577350,NaN
Rachel,NaN,-1.224745,0.000000,0.5,NaN,NaN
Christine,0.447214,0.000000,NaN,NaN,-0.577350,NaN

### Standardized Averages

In [8]:
#Average standardized ratings for each user.
avg_standardized_user = standardized_ratings.mean(axis=1)
avg_standardized_user

Hazel       -0.759177
Mark        -0.429618
Vivian       0.942220
John         0.318922
Rachel      -0.241582
Christine   -0.043379
dtype: float64

In [9]:
#Average standardized ratings for each movie.
avg_standardized_movie = standardized_ratings.mean()
avg_standardized_movie

Parasite              4.218847e-16
Joker                 0.000000e+00
Toy Story 4           0.000000e+00
Frozen II             0.000000e+00
Little Women         -2.960595e-16
The Marriage Story             NaN
dtype: float64